podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKL27Z256M4.h
/****************************************************************************************************//**
 * @file     $(targetDevice).h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for MKL27Z256M4.
 *           Equivalent: MKL27Z128M4, MKL27Z256M4
 *
 * @version  V0.0
 * @date     2015/07
 *
 *******************************************************************************************************/

#ifndef MCU_MKL27Z256M4
#define MCU_MKL27Z256M4

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup Interrupt_vector_numbers_GROUP Interrupt vector numbers
* @brief Vector numbers required for NVIC functions
* @{
*/
/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
 * Interrupt vector numbers
 */
typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /**<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /**<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /**<   3 Hard Fault, all classes of Fault                                                 */
  SVCall_IRQn                   =  -5,   /**<  11 System Service Call via SVC instruction                                          */
  PendSV_IRQn                   =  -2,   /**<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /**<  15 System Tick Timer                                                                */
/* ----------------------   MKL27Z4(128 and 256K) VectorTable        ---------------------- */
  DMA0_IRQn                     =   0,   /**<  16 DMA0 Transfer complete or error                                                  */
  DMA1_IRQn                     =   1,   /**<  17 DMA1 Transfer complete or error                                                  */
  DMA2_IRQn                     =   2,   /**<  18 DMA2 Transfer complete or error                                                  */
  DMA3_IRQn                     =   3,   /**<  19 DMA3 Transfer complete or error                                                  */
  FTFA_IRQn                     =   5,   /**<  21 FTFA Command complete or error                                                   */
  PMC_IRQn                      =   6,   /**<  22 PMC Low-voltage detect, low-voltage warning                                      */
  LLWU_IRQn                     =   7,   /**<  23 Low Leakage Wakeup                                                               */
  I2C0_IRQn                     =   8,   /**<  24 I2C Interface 0                                                                  */
  I2C1_IRQn                     =   9,   /**<  25 I2C Interface 1                                                                  */
  SPI0_IRQn                     =  10,   /**<  26 Serial Peripheral Interface 0                                                    */
  SPI1_IRQn                     =  11,   /**<  27 Serial Peripheral Interface 1                                                    */
  LPUART0_IRQn                  =  12,   /**<  28 UART0 Status and error                                                           */
  LPUART1_IRQn                  =  13,   /**<  29 UART1 Status and error                                                           */
  UART2_FLEXIO_IRQn             =  14,   /**<  30 UART2 or FLEXIO Status and error                                                 */
  ADC0_IRQn                     =  15,   /**<  31 Analogue to Digital Converter 0                                                  */
  ACMP0_IRQn                    =  16,   /**<  32 Analogue comparator 0                                                            */
  TPM0_IRQn                     =  17,   /**<  33 Timer/PWM Module 0                                                               */
  TPM1_IRQn                     =  18,   /**<  34 Timer/PWM Module 1                                                               */
  TPM2_IRQn                     =  19,   /**<  35 Timer/PWM Module 2                                                               */
  RTC_Alarm_IRQn                =  20,   /**<  36 Real Time Clock Alarm                                                            */
  RTC_Seconds_IRQn              =  21,   /**<  37 Real Time Clock Seconds                                                          */
  PIT_IRQn                      =  22,   /**<  38 Programmable Interrupt Timer (All channels)                                      */
  I2S0_IRQn                     =  23,   /**<  39 I2S0                                                                             */
  USBOTG_IRQn                   =  24,   /**<  40 USBB On The Go                                                                   */
  DAC0_IRQn                     =  25,   /**<  41 Digital to Analogue Converter                                                    */
  LPTMR0_IRQn                   =  28,   /**<  44 Low Power Timer                                                                  */
  PORTA_IRQn                    =  30,   /**<  46 Port A                                                                           */
  PORTC_D_IRQn                  =  31,   /**<  47 Port C & Port D                                                                  */
} IRQn_Type;

/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                 /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);           /**< Hard Fault, all classes of Fault                                                 */
extern void SVC_Handler(void);                 /**< System Service Call via SVC instruction                                          */
extern void PendSV_Handler(void);              /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);             /**< System Tick Timer                                                                */
extern void DMA0_IRQHandler(void);             /**< DMA0 Transfer complete or error                                                  */
extern void DMA1_IRQHandler(void);             /**< DMA1 Transfer complete or error                                                  */
extern void DMA2_IRQHandler(void);             /**< DMA2 Transfer complete or error                                                  */
extern void DMA3_IRQHandler(void);             /**< DMA3 Transfer complete or error                                                  */
extern void FTFA_IRQHandler(void);             /**< FTFA Command complete or error                                                   */
extern void PMC_IRQHandler(void);              /**< PMC Low-voltage detect, low-voltage warning                                      */
extern void LLWU_IRQHandler(void);             /**< Low Leakage Wakeup                                                               */
extern void I2C0_IRQHandler(void);             /**< I2C Interface 0                                                                  */
extern void I2C1_IRQHandler(void);             /**< I2C Interface 1                                                                  */
extern void SPI0_IRQHandler(void);             /**< Serial Peripheral Interface 0                                                    */
extern void SPI1_IRQHandler(void);             /**< Serial Peripheral Interface 1                                                    */
extern void LPUART0_IRQHandler(void);          /**< UART0 Status and error                                                           */
extern void LPUART1_IRQHandler(void);          /**< UART1 Status and error                                                           */
extern void UART2_FLEXIO_IRQHandler(void);     /**< UART2 or FLEXIO Status and error                                                 */
extern void ADC0_IRQHandler(void);             /**< Analogue to Digital Converter 0                                                  */
extern void ACMP0_IRQHandler(void);            /**< Analogue comparator 0                                                            */
extern void TPM0_IRQHandler(void);             /**< Timer/PWM Module 0                                                               */
extern void TPM1_IRQHandler(void);             /**< Timer/PWM Module 1                                                               */
extern void TPM2_IRQHandler(void);             /**< Timer/PWM Module 2                                                               */
extern void RTC_Alarm_IRQHandler(void);        /**< Real Time Clock Alarm                                                            */
extern void RTC_Seconds_IRQHandler(void);      /**< Real Time Clock Seconds                                                          */
extern void PIT_IRQHandler(void);              /**< Programmable Interrupt Timer (All channels)                                      */
extern void I2S0_IRQHandler(void);             /**< I2S0                                                                             */
extern void USBOTG_IRQHandler(void);           /**< USBB On The Go                                                                   */
extern void DAC0_IRQHandler(void);             /**< Digital to Analogue Converter                                                    */
extern void LPTMR0_IRQHandler(void);           /**< Low Power Timer                                                                  */
extern void PORTA_IRQHandler(void);            /**< Port A                                                                           */
extern void PORTC_D_IRQHandler(void);          /**< Port C & Port D                                                                  */

/**
 * @} */ /* End group Interrupt_handler_prototypes_GROUP 
 */
/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/**
* @addtogroup Cortex_Core_Configuration_GROUP Cortex Core Configuration
* @brief Configuration of the cm4 Processor and Core Peripherals
* @{
*/
#define __CM0PLUS_REV             0x0100     /**< CPU Revision                                        */
#define __MPU_PRESENT             0          /**< Whether MPU is present                              */
#define __NVIC_PRIO_BITS          2          /**< Number of implemented bits in NVIC PRIO register    */
#define __Vendor_SysTickConfig    0          /**< Whether Vendor implemented SYSTICK timer is present */
#define __FPU_PRESENT             0          /**< Whether FPU is present                              */
#define __VTOR_PRESENT            1          /**< Whether VTOR register is present                    */

/**
 * @} */ /* End group Cortex_Core_Configuration_GROUP 
 */
#include "core_cm0plus.h"       /* Processor and core peripherals     */
#include "system.h"             /* Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

