podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKL27Z256M4.h
/**
* @addtogroup LPUART_Register_Masks_GROUP LPUART Register Masks
* @brief Register Masks for LPUART
* @{
*/
/* ------- BAUD Bit Fields                          ------ */
#define LPUART_BAUD_SBR_MASK                     (0x1FFFUL << LPUART_BAUD_SBR_SHIFT)                 /*!< LPUART0_BAUD: SBR Mask                  */
#define LPUART_BAUD_SBR_SHIFT                    0                                                   /*!< LPUART0_BAUD: SBR Position              */
#define LPUART_BAUD_SBR(x)                       (((uint32_t)(((uint32_t)(x))<<LPUART_BAUD_SBR_SHIFT))&LPUART_BAUD_SBR_MASK) /*!< LPUART0_BAUD                            */
#define LPUART_BAUD_SBNS_MASK                    (0x01UL << LPUART_BAUD_SBNS_SHIFT)                  /*!< LPUART0_BAUD: SBNS Mask                 */
#define LPUART_BAUD_SBNS_SHIFT                   13                                                  /*!< LPUART0_BAUD: SBNS Position             */
#define LPUART_BAUD_RXEDGIE_MASK                 (0x01UL << LPUART_BAUD_RXEDGIE_SHIFT)               /*!< LPUART0_BAUD: RXEDGIE Mask              */
#define LPUART_BAUD_RXEDGIE_SHIFT                14                                                  /*!< LPUART0_BAUD: RXEDGIE Position          */
#define LPUART_BAUD_LBKDIE_MASK                  (0x01UL << LPUART_BAUD_LBKDIE_SHIFT)                /*!< LPUART0_BAUD: LBKDIE Mask               */
#define LPUART_BAUD_LBKDIE_SHIFT                 15                                                  /*!< LPUART0_BAUD: LBKDIE Position           */
#define LPUART_BAUD_RESYNCDIS_MASK               (0x01UL << LPUART_BAUD_RESYNCDIS_SHIFT)             /*!< LPUART0_BAUD: RESYNCDIS Mask            */
#define LPUART_BAUD_RESYNCDIS_SHIFT              16                                                  /*!< LPUART0_BAUD: RESYNCDIS Position        */
#define LPUART_BAUD_BOTHEDGE_MASK                (0x01UL << LPUART_BAUD_BOTHEDGE_SHIFT)              /*!< LPUART0_BAUD: BOTHEDGE Mask             */
#define LPUART_BAUD_BOTHEDGE_SHIFT               17                                                  /*!< LPUART0_BAUD: BOTHEDGE Position         */
#define LPUART_BAUD_MATCFG_MASK                  (0x03UL << LPUART_BAUD_MATCFG_SHIFT)                /*!< LPUART0_BAUD: MATCFG Mask               */
#define LPUART_BAUD_MATCFG_SHIFT                 18                                                  /*!< LPUART0_BAUD: MATCFG Position           */
#define LPUART_BAUD_MATCFG(x)                    (((uint32_t)(((uint32_t)(x))<<LPUART_BAUD_MATCFG_SHIFT))&LPUART_BAUD_MATCFG_MASK) /*!< LPUART0_BAUD                            */
#define LPUART_BAUD_RDMAE_MASK                   (0x01UL << LPUART_BAUD_RDMAE_SHIFT)                 /*!< LPUART0_BAUD: RDMAE Mask                */
#define LPUART_BAUD_RDMAE_SHIFT                  21                                                  /*!< LPUART0_BAUD: RDMAE Position            */
#define LPUART_BAUD_TDMAE_MASK                   (0x01UL << LPUART_BAUD_TDMAE_SHIFT)                 /*!< LPUART0_BAUD: TDMAE Mask                */
#define LPUART_BAUD_TDMAE_SHIFT                  23                                                  /*!< LPUART0_BAUD: TDMAE Position            */
#define LPUART_BAUD_OSR_MASK                     (0x1FUL << LPUART_BAUD_OSR_SHIFT)                   /*!< LPUART0_BAUD: OSR Mask                  */
#define LPUART_BAUD_OSR_SHIFT                    24                                                  /*!< LPUART0_BAUD: OSR Position              */
#define LPUART_BAUD_OSR(x)                       (((uint32_t)(((uint32_t)(x))<<LPUART_BAUD_OSR_SHIFT))&LPUART_BAUD_OSR_MASK) /*!< LPUART0_BAUD                            */
#define LPUART_BAUD_M10_MASK                     (0x01UL << LPUART_BAUD_M10_SHIFT)                   /*!< LPUART0_BAUD: M10 Mask                  */
#define LPUART_BAUD_M10_SHIFT                    29                                                  /*!< LPUART0_BAUD: M10 Position              */
#define LPUART_BAUD_MAEN2_MASK                   (0x01UL << LPUART_BAUD_MAEN2_SHIFT)                 /*!< LPUART0_BAUD: MAEN2 Mask                */
#define LPUART_BAUD_MAEN2_SHIFT                  30                                                  /*!< LPUART0_BAUD: MAEN2 Position            */
#define LPUART_BAUD_MAEN1_MASK                   (0x01UL << LPUART_BAUD_MAEN1_SHIFT)                 /*!< LPUART0_BAUD: MAEN1 Mask                */
#define LPUART_BAUD_MAEN1_SHIFT                  31                                                  /*!< LPUART0_BAUD: MAEN1 Position            */
/* ------- STAT Bit Fields                          ------ */
#define LPUART_STAT_MA2F_MASK                    (0x01UL << LPUART_STAT_MA2F_SHIFT)                  /*!< LPUART0_STAT: MA2F Mask                 */
#define LPUART_STAT_MA2F_SHIFT                   14                                                  /*!< LPUART0_STAT: MA2F Position             */
#define LPUART_STAT_MA1F_MASK                    (0x01UL << LPUART_STAT_MA1F_SHIFT)                  /*!< LPUART0_STAT: MA1F Mask                 */
#define LPUART_STAT_MA1F_SHIFT                   15                                                  /*!< LPUART0_STAT: MA1F Position             */
#define LPUART_STAT_PF_MASK                      (0x01UL << LPUART_STAT_PF_SHIFT)                    /*!< LPUART0_STAT: PF Mask                   */
#define LPUART_STAT_PF_SHIFT                     16                                                  /*!< LPUART0_STAT: PF Position               */
#define LPUART_STAT_FE_MASK                      (0x01UL << LPUART_STAT_FE_SHIFT)                    /*!< LPUART0_STAT: FE Mask                   */
#define LPUART_STAT_FE_SHIFT                     17                                                  /*!< LPUART0_STAT: FE Position               */
#define LPUART_STAT_NF_MASK                      (0x01UL << LPUART_STAT_NF_SHIFT)                    /*!< LPUART0_STAT: NF Mask                   */
#define LPUART_STAT_NF_SHIFT                     18                                                  /*!< LPUART0_STAT: NF Position               */
#define LPUART_STAT_OR_MASK                      (0x01UL << LPUART_STAT_OR_SHIFT)                    /*!< LPUART0_STAT: OR Mask                   */
#define LPUART_STAT_OR_SHIFT                     19                                                  /*!< LPUART0_STAT: OR Position               */
#define LPUART_STAT_IDLE_MASK                    (0x01UL << LPUART_STAT_IDLE_SHIFT)                  /*!< LPUART0_STAT: IDLE Mask                 */
#define LPUART_STAT_IDLE_SHIFT                   20                                                  /*!< LPUART0_STAT: IDLE Position             */
#define LPUART_STAT_RDRF_MASK                    (0x01UL << LPUART_STAT_RDRF_SHIFT)                  /*!< LPUART0_STAT: RDRF Mask                 */
#define LPUART_STAT_RDRF_SHIFT                   21                                                  /*!< LPUART0_STAT: RDRF Position             */
#define LPUART_STAT_TC_MASK                      (0x01UL << LPUART_STAT_TC_SHIFT)                    /*!< LPUART0_STAT: TC Mask                   */
#define LPUART_STAT_TC_SHIFT                     22                                                  /*!< LPUART0_STAT: TC Position               */
#define LPUART_STAT_TDRE_MASK                    (0x01UL << LPUART_STAT_TDRE_SHIFT)                  /*!< LPUART0_STAT: TDRE Mask                 */
#define LPUART_STAT_TDRE_SHIFT                   23                                                  /*!< LPUART0_STAT: TDRE Position             */
#define LPUART_STAT_RAF_MASK                     (0x01UL << LPUART_STAT_RAF_SHIFT)                   /*!< LPUART0_STAT: RAF Mask                  */
#define LPUART_STAT_RAF_SHIFT                    24                                                  /*!< LPUART0_STAT: RAF Position              */
#define LPUART_STAT_LBKDE_MASK                   (0x01UL << LPUART_STAT_LBKDE_SHIFT)                 /*!< LPUART0_STAT: LBKDE Mask                */
#define LPUART_STAT_LBKDE_SHIFT                  25                                                  /*!< LPUART0_STAT: LBKDE Position            */
#define LPUART_STAT_BRK13_MASK                   (0x01UL << LPUART_STAT_BRK13_SHIFT)                 /*!< LPUART0_STAT: BRK13 Mask                */
#define LPUART_STAT_BRK13_SHIFT                  26                                                  /*!< LPUART0_STAT: BRK13 Position            */
#define LPUART_STAT_RWUID_MASK                   (0x01UL << LPUART_STAT_RWUID_SHIFT)                 /*!< LPUART0_STAT: RWUID Mask                */
#define LPUART_STAT_RWUID_SHIFT                  27                                                  /*!< LPUART0_STAT: RWUID Position            */
#define LPUART_STAT_RXINV_MASK                   (0x01UL << LPUART_STAT_RXINV_SHIFT)                 /*!< LPUART0_STAT: RXINV Mask                */
#define LPUART_STAT_RXINV_SHIFT                  28                                                  /*!< LPUART0_STAT: RXINV Position            */
#define LPUART_STAT_MSBF_MASK                    (0x01UL << LPUART_STAT_MSBF_SHIFT)                  /*!< LPUART0_STAT: MSBF Mask                 */
#define LPUART_STAT_MSBF_SHIFT                   29                                                  /*!< LPUART0_STAT: MSBF Position             */
#define LPUART_STAT_RXEDGIF_MASK                 (0x01UL << LPUART_STAT_RXEDGIF_SHIFT)               /*!< LPUART0_STAT: RXEDGIF Mask              */
#define LPUART_STAT_RXEDGIF_SHIFT                30                                                  /*!< LPUART0_STAT: RXEDGIF Position          */
#define LPUART_STAT_LBKDIF_MASK                  (0x01UL << LPUART_STAT_LBKDIF_SHIFT)                /*!< LPUART0_STAT: LBKDIF Mask               */
#define LPUART_STAT_LBKDIF_SHIFT                 31                                                  /*!< LPUART0_STAT: LBKDIF Position           */
/* ------- CTRL Bit Fields                          ------ */
#define LPUART_CTRL_PT_MASK                      (0x01UL << LPUART_CTRL_PT_SHIFT)                    /*!< LPUART0_CTRL: PT Mask                   */
#define LPUART_CTRL_PT_SHIFT                     0                                                   /*!< LPUART0_CTRL: PT Position               */
#define LPUART_CTRL_PE_MASK                      (0x01UL << LPUART_CTRL_PE_SHIFT)                    /*!< LPUART0_CTRL: PE Mask                   */
#define LPUART_CTRL_PE_SHIFT                     1                                                   /*!< LPUART0_CTRL: PE Position               */
#define LPUART_CTRL_ILT_MASK                     (0x01UL << LPUART_CTRL_ILT_SHIFT)                   /*!< LPUART0_CTRL: ILT Mask                  */
#define LPUART_CTRL_ILT_SHIFT                    2                                                   /*!< LPUART0_CTRL: ILT Position              */
#define LPUART_CTRL_WAKE_MASK                    (0x01UL << LPUART_CTRL_WAKE_SHIFT)                  /*!< LPUART0_CTRL: WAKE Mask                 */
#define LPUART_CTRL_WAKE_SHIFT                   3                                                   /*!< LPUART0_CTRL: WAKE Position             */
#define LPUART_CTRL_M_MASK                       (0x01UL << LPUART_CTRL_M_SHIFT)                     /*!< LPUART0_CTRL: M Mask                    */
#define LPUART_CTRL_M_SHIFT                      4                                                   /*!< LPUART0_CTRL: M Position                */
#define LPUART_CTRL_RSRC_MASK                    (0x01UL << LPUART_CTRL_RSRC_SHIFT)                  /*!< LPUART0_CTRL: RSRC Mask                 */
#define LPUART_CTRL_RSRC_SHIFT                   5                                                   /*!< LPUART0_CTRL: RSRC Position             */
#define LPUART_CTRL_DOZEEN_MASK                  (0x01UL << LPUART_CTRL_DOZEEN_SHIFT)                /*!< LPUART0_CTRL: DOZEEN Mask               */
#define LPUART_CTRL_DOZEEN_SHIFT                 6                                                   /*!< LPUART0_CTRL: DOZEEN Position           */
#define LPUART_CTRL_LOOPS_MASK                   (0x01UL << LPUART_CTRL_LOOPS_SHIFT)                 /*!< LPUART0_CTRL: LOOPS Mask                */
#define LPUART_CTRL_LOOPS_SHIFT                  7                                                   /*!< LPUART0_CTRL: LOOPS Position            */
#define LPUART_CTRL_MA2IE_MASK                   (0x01UL << LPUART_CTRL_MA2IE_SHIFT)                 /*!< LPUART0_CTRL: MA2IE Mask                */
#define LPUART_CTRL_MA2IE_SHIFT                  14                                                  /*!< LPUART0_CTRL: MA2IE Position            */
#define LPUART_CTRL_MA1IE_MASK                   (0x01UL << LPUART_CTRL_MA1IE_SHIFT)                 /*!< LPUART0_CTRL: MA1IE Mask                */
#define LPUART_CTRL_MA1IE_SHIFT                  15                                                  /*!< LPUART0_CTRL: MA1IE Position            */
#define LPUART_CTRL_SBK_MASK                     (0x01UL << LPUART_CTRL_SBK_SHIFT)                   /*!< LPUART0_CTRL: SBK Mask                  */
#define LPUART_CTRL_SBK_SHIFT                    16                                                  /*!< LPUART0_CTRL: SBK Position              */
#define LPUART_CTRL_RWU_MASK                     (0x01UL << LPUART_CTRL_RWU_SHIFT)                   /*!< LPUART0_CTRL: RWU Mask                  */
#define LPUART_CTRL_RWU_SHIFT                    17                                                  /*!< LPUART0_CTRL: RWU Position              */
#define LPUART_CTRL_RE_MASK                      (0x01UL << LPUART_CTRL_RE_SHIFT)                    /*!< LPUART0_CTRL: RE Mask                   */
#define LPUART_CTRL_RE_SHIFT                     18                                                  /*!< LPUART0_CTRL: RE Position               */
#define LPUART_CTRL_TE_MASK                      (0x01UL << LPUART_CTRL_TE_SHIFT)                    /*!< LPUART0_CTRL: TE Mask                   */
#define LPUART_CTRL_TE_SHIFT                     19                                                  /*!< LPUART0_CTRL: TE Position               */
#define LPUART_CTRL_ILIE_MASK                    (0x01UL << LPUART_CTRL_ILIE_SHIFT)                  /*!< LPUART0_CTRL: ILIE Mask                 */
#define LPUART_CTRL_ILIE_SHIFT                   20                                                  /*!< LPUART0_CTRL: ILIE Position             */
#define LPUART_CTRL_RIE_MASK                     (0x01UL << LPUART_CTRL_RIE_SHIFT)                   /*!< LPUART0_CTRL: RIE Mask                  */
#define LPUART_CTRL_RIE_SHIFT                    21                                                  /*!< LPUART0_CTRL: RIE Position              */
#define LPUART_CTRL_TCIE_MASK                    (0x01UL << LPUART_CTRL_TCIE_SHIFT)                  /*!< LPUART0_CTRL: TCIE Mask                 */
#define LPUART_CTRL_TCIE_SHIFT                   22                                                  /*!< LPUART0_CTRL: TCIE Position             */
#define LPUART_CTRL_TIE_MASK                     (0x01UL << LPUART_CTRL_TIE_SHIFT)                   /*!< LPUART0_CTRL: TIE Mask                  */
#define LPUART_CTRL_TIE_SHIFT                    23                                                  /*!< LPUART0_CTRL: TIE Position              */
#define LPUART_CTRL_PEIE_MASK                    (0x01UL << LPUART_CTRL_PEIE_SHIFT)                  /*!< LPUART0_CTRL: PEIE Mask                 */
#define LPUART_CTRL_PEIE_SHIFT                   24                                                  /*!< LPUART0_CTRL: PEIE Position             */
#define LPUART_CTRL_FEIE_MASK                    (0x01UL << LPUART_CTRL_FEIE_SHIFT)                  /*!< LPUART0_CTRL: FEIE Mask                 */
#define LPUART_CTRL_FEIE_SHIFT                   25                                                  /*!< LPUART0_CTRL: FEIE Position             */
#define LPUART_CTRL_NEIE_MASK                    (0x01UL << LPUART_CTRL_NEIE_SHIFT)                  /*!< LPUART0_CTRL: NEIE Mask                 */
#define LPUART_CTRL_NEIE_SHIFT                   26                                                  /*!< LPUART0_CTRL: NEIE Position             */
#define LPUART_CTRL_ORIE_MASK                    (0x01UL << LPUART_CTRL_ORIE_SHIFT)                  /*!< LPUART0_CTRL: ORIE Mask                 */
#define LPUART_CTRL_ORIE_SHIFT                   27                                                  /*!< LPUART0_CTRL: ORIE Position             */
#define LPUART_CTRL_TXINV_MASK                   (0x01UL << LPUART_CTRL_TXINV_SHIFT)                 /*!< LPUART0_CTRL: TXINV Mask                */
#define LPUART_CTRL_TXINV_SHIFT                  28                                                  /*!< LPUART0_CTRL: TXINV Position            */
#define LPUART_CTRL_TXDIR_MASK                   (0x01UL << LPUART_CTRL_TXDIR_SHIFT)                 /*!< LPUART0_CTRL: TXDIR Mask                */
#define LPUART_CTRL_TXDIR_SHIFT                  29                                                  /*!< LPUART0_CTRL: TXDIR Position            */
#define LPUART_CTRL_R9T8_MASK                    (0x01UL << LPUART_CTRL_R9T8_SHIFT)                  /*!< LPUART0_CTRL: R9T8 Mask                 */
#define LPUART_CTRL_R9T8_SHIFT                   30                                                  /*!< LPUART0_CTRL: R9T8 Position             */
#define LPUART_CTRL_R8T9_MASK                    (0x01UL << LPUART_CTRL_R8T9_SHIFT)                  /*!< LPUART0_CTRL: R8T9 Mask                 */
#define LPUART_CTRL_R8T9_SHIFT                   31                                                  /*!< LPUART0_CTRL: R8T9 Position             */
/* ------- DATA Bit Fields                          ------ */
#define LPUART_DATA_RT_MASK                      (0x3FFUL << LPUART_DATA_RT_SHIFT)                   /*!< LPUART0_DATA: RT Mask                   */
#define LPUART_DATA_RT_SHIFT                     0                                                   /*!< LPUART0_DATA: RT Position               */
#define LPUART_DATA_RT(x)                        (((uint32_t)(((uint32_t)(x))<<LPUART_DATA_RT_SHIFT))&LPUART_DATA_RT_MASK) /*!< LPUART0_DATA                            */
#define LPUART_DATA_IDLINE_MASK                  (0x01UL << LPUART_DATA_IDLINE_SHIFT)                /*!< LPUART0_DATA: IDLINE Mask               */
#define LPUART_DATA_IDLINE_SHIFT                 11                                                  /*!< LPUART0_DATA: IDLINE Position           */
#define LPUART_DATA_RXEMPT_MASK                  (0x01UL << LPUART_DATA_RXEMPT_SHIFT)                /*!< LPUART0_DATA: RXEMPT Mask               */
#define LPUART_DATA_RXEMPT_SHIFT                 12                                                  /*!< LPUART0_DATA: RXEMPT Position           */
#define LPUART_DATA_FRETSC_MASK                  (0x01UL << LPUART_DATA_FRETSC_SHIFT)                /*!< LPUART0_DATA: FRETSC Mask               */
#define LPUART_DATA_FRETSC_SHIFT                 13                                                  /*!< LPUART0_DATA: FRETSC Position           */
#define LPUART_DATA_PARITYE_MASK                 (0x01UL << LPUART_DATA_PARITYE_SHIFT)               /*!< LPUART0_DATA: PARITYE Mask              */
#define LPUART_DATA_PARITYE_SHIFT                14                                                  /*!< LPUART0_DATA: PARITYE Position          */
#define LPUART_DATA_NOISY_MASK                   (0x01UL << LPUART_DATA_NOISY_SHIFT)                 /*!< LPUART0_DATA: NOISY Mask                */
#define LPUART_DATA_NOISY_SHIFT                  15                                                  /*!< LPUART0_DATA: NOISY Position            */
/* ------- MATCH Bit Fields                         ------ */
#define LPUART_MATCH_MA1_MASK                    (0x3FFUL << LPUART_MATCH_MA1_SHIFT)                 /*!< LPUART0_MATCH: MA1 Mask                 */
#define LPUART_MATCH_MA1_SHIFT                   0                                                   /*!< LPUART0_MATCH: MA1 Position             */
#define LPUART_MATCH_MA1(x)                      (((uint32_t)(((uint32_t)(x))<<LPUART_MATCH_MA1_SHIFT))&LPUART_MATCH_MA1_MASK) /*!< LPUART0_MATCH                           */
#define LPUART_MATCH_MA2_MASK                    (0x3FFUL << LPUART_MATCH_MA2_SHIFT)                 /*!< LPUART0_MATCH: MA2 Mask                 */
#define LPUART_MATCH_MA2_SHIFT                   16                                                  /*!< LPUART0_MATCH: MA2 Position             */
#define LPUART_MATCH_MA2(x)                      (((uint32_t)(((uint32_t)(x))<<LPUART_MATCH_MA2_SHIFT))&LPUART_MATCH_MA2_MASK) /*!< LPUART0_MATCH                           */
/**
 * @} */ /* End group LPUART_Register_Masks_GROUP 
 */

/* LPUART0 - Peripheral instance base addresses */
#define LPUART0_BasePtr                0x40054000UL //!< Peripheral base address
#define LPUART0                        ((LPUART_Type *) LPUART0_BasePtr) //!< Freescale base pointer
#define LPUART0_BASE_PTR               (LPUART0) //!< Freescale style base pointer
/**
 * @} */ /* End group LPUART_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup LPUART_Peripheral_access_layer_GROUP LPUART Peripheral Access Layer
* @brief C Struct for LPUART
* @{
*/

/* ================================================================================ */
/* ================           LPUART1 (derived from LPUART0)       ================ */
/* ================================================================================ */

/**
 * @brief Low Power Universal Asynchronous Receiver/Transmitter
 */

