podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/MKL27Z256M4.h
/* UART2 - Peripheral instance base addresses */
#define UART2_BasePtr                  0x4006C000UL //!< Peripheral base address
#define UART2                          ((UART2_Type *) UART2_BasePtr) //!< Freescale base pointer
#define UART2_BASE_PTR                 (UART2) //!< Freescale style base pointer
/**
 * @} */ /* End group UART_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup USB_Peripheral_access_layer_GROUP USB Peripheral Access Layer
* @brief C Struct for USB
* @{
*/

/* ================================================================================ */
/* ================           USB0 (file:USB0_CLK_RECOVER_1)       ================ */
/* ================================================================================ */

/**
 * @brief Universal Serial Bus, OTG Capable Controller
 */
/**
* @addtogroup USB_structs_GROUP USB struct
* @brief Struct for USB
* @{
*/
typedef struct {                                /*       USB0 Structure                                               */
   __I  uint8_t   PERID;                        /**< 0000: Peripheral ID Register                                       */
   __I  uint8_t   RESERVED0[3];                
   __I  uint8_t   IDCOMP;                       /**< 0004: Peripheral ID Complement Register                            */
   __I  uint8_t   RESERVED1[3];                
   __I  uint8_t   REV;                          /**< 0008: Peripheral Revision Register                                 */
   __I  uint8_t   RESERVED2[3];                
   __I  uint8_t   ADDINFO;                      /**< 000C: Peripheral Additional Info Register                          */
   __I  uint8_t   RESERVED3[3];                
   __IO uint8_t   OTGISTAT;                     /**< 0010: OTG Interrupt Status Register                                */
   __I  uint8_t   RESERVED4[3];                
   __IO uint8_t   OTGICR;                       /**< 0014: OTG Interrupt Control Register                               */
   __I  uint8_t   RESERVED5[3];                
   __IO uint8_t   OTGSTAT;                      /**< 0018: OTG Status Register                                          */
   __I  uint8_t   RESERVED6[3];                
   __IO uint8_t   OTGCTL;                       /**< 001C: OTG Control Register                                         */
   __I  uint8_t   RESERVED7[99];               
   __IO uint8_t   ISTAT;                        /**< 0080: Interrupt Status Register                                    */
   __I  uint8_t   RESERVED8[3];                
   __IO uint8_t   INTEN;                        /**< 0084: Interrupt Enable Register                                    */
   __I  uint8_t   RESERVED9[3];                
   __IO uint8_t   ERRSTAT;                      /**< 0088: Error Interrupt Status Register                              */
   __I  uint8_t   RESERVED10[3];               
   __IO uint8_t   ERREN;                        /**< 008C: Error Interrupt Enable Register                              */
   __I  uint8_t   RESERVED11[3];               
   __I  uint8_t   STAT;                         /**< 0090: Status Register                                              */
   __I  uint8_t   RESERVED12[3];               
   __IO uint8_t   CTL;                          /**< 0094: Control Register                                             */
   __I  uint8_t   RESERVED13[3];               
   __IO uint8_t   ADDR;                         /**< 0098: Address Register                                             */
   __I  uint8_t   RESERVED14[3];               
   __IO uint8_t   BDTPAGE1;                     /**< 009C: BDT Page Register 1                                          */
   __I  uint8_t   RESERVED15[3];               
   __IO uint8_t   FRMNUML;                      /**< 00A0: Frame Number Register Low                                    */
   __I  uint8_t   RESERVED16[3];               
   __IO uint8_t   FRMNUMH;                      /**< 00A4: Frame Number Register High                                   */
   __I  uint8_t   RESERVED17[3];               
   __IO uint8_t   TOKEN;                        /**< 00A8: Token Register                                               */
   __I  uint8_t   RESERVED18[3];               
   __IO uint8_t   SOFTHLD;                      /**< 00AC: SOF Threshold Register                                       */
   __I  uint8_t   RESERVED19[3];               
   __IO uint8_t   BDTPAGE2;                     /**< 00B0: BDT Page Register 2                                          */
   __I  uint8_t   RESERVED20[3];               
   __IO uint8_t   BDTPAGE3;                     /**< 00B4: BDT Page Register 3                                          */
   __I  uint8_t   RESERVED21[11];              
   struct {
      __IO uint8_t   ENDPT;                     /**< 00C0: Endpoint Control Register                                    */
      __I  uint8_t   RESERVED0[3];             
   } ENDPOINT[16];                              /**< 00C0: (cluster: size=0x0040, 64)                                   */
   __IO uint8_t   USBCTRL;                      /**< 0100: USB Control Register                                         */
   __I  uint8_t   RESERVED22[3];               
   __I  uint8_t   OBSERVE;                      /**< 0104: USB OTG Observe Register                                     */
   __I  uint8_t   RESERVED23[3];               
   __IO uint8_t   CONTROL;                      /**< 0108: USB OTG Control Register                                     */
   __I  uint8_t   RESERVED24[3];               
   __IO uint8_t   USBTRC0;                      /**< 010C: USB Transceiver Control Register 0                           */
   __I  uint8_t   RESERVED25[7];               
   __IO uint8_t   USBFRMADJUST;                 /**< 0114: Frame Adjust Register                                        */
   __I  uint8_t   RESERVED26[43];              
   __IO uint8_t   CLK_RECOVER_CTRL;             /**< 0140: USB Clock recovery control                                   */
   __I  uint8_t   RESERVED27[3];               
   __IO uint8_t   CLK_RECOVER_IRC_EN;           /**< 0144: IRC48M oscillator enable register                            */
   __I  uint8_t   RESERVED28[23];              
   __IO uint8_t   CLK_RECOVER_INT_STATUS;       /**< 015C: Clock recovery separated interrupt status                    */
} USB_Type;

/**
 * @} */ /* End group USB_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'USB0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

